{
  "nodes": [
    {
      "op": "null", 
      "param": {}, 
      "name": "label", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "_MulScalar", 
      "param": {"scalar": "-1"}, 
      "name": "_mulscalar0", 
      "inputs": [[0, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "part1_data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_0_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_0_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART1_COV_0_conv", 
      "inputs": [[2, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_0_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_0_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART1_COV_0_bn", 
      "inputs": [[5, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART1_COV_0_pool", 
      "inputs": [[8, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART1_COV_0_relu", 
      "inputs": [[9, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_1_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_1_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART1_COV_1_conv", 
      "inputs": [[10, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_1_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_1_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART1_COV_1_bn", 
      "inputs": [[13, 0], [14, 0], [15, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART1_COV_1_pool", 
      "inputs": [[16, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART1_COV_1_relu", 
      "inputs": [[17, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_2_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_2_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART1_COV_2_conv", 
      "inputs": [[18, 0], [19, 0], [20, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_2_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_2_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART1_COV_2_bn", 
      "inputs": [[21, 0], [22, 0], [23, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART1_COV_2_pool", 
      "inputs": [[24, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART1_COV_2_relu", 
      "inputs": [[25, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_3_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_3_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART1_COV_3_conv", 
      "inputs": [[26, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_3_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_3_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART1_COV_3_bn", 
      "inputs": [[29, 0], [30, 0], [31, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART1_COV_3_pool", 
      "inputs": [[32, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART1_COV_3_relu", 
      "inputs": [[33, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_4_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_4_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART1_COV_4_conv", 
      "inputs": [[34, 0], [35, 0], [36, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_4_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_4_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART1_COV_4_bn", 
      "inputs": [[37, 0], [38, 0], [39, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART1_COV_4_pool", 
      "inputs": [[40, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART1_COV_4_relu", 
      "inputs": [[41, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_5_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "conv_5_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART1_COV_5_conv", 
      "inputs": [[42, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_5_gamma", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "bn_5_beta", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART1_COV_5_bn", 
      "inputs": [[45, 0], [46, 0], [47, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART1_COV_5_pool", 
      "inputs": [[48, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART1_COV_5_relu", 
      "inputs": [[49, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Flatten", 
      "param": {}, 
      "name": "flatten1", 
      "inputs": [[50, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "part2_data", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART2_COV_0_conv", 
      "inputs": [[52, 0], [3, 0], [4, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART2_COV_0_bn", 
      "inputs": [[53, 0], [6, 0], [7, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART2_COV_0_pool", 
      "inputs": [[54, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART2_COV_0_relu", 
      "inputs": [[55, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART2_COV_1_conv", 
      "inputs": [[56, 0], [11, 0], [12, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART2_COV_1_bn", 
      "inputs": [[57, 0], [14, 0], [15, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART2_COV_1_pool", 
      "inputs": [[58, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART2_COV_1_relu", 
      "inputs": [[59, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART2_COV_2_conv", 
      "inputs": [[60, 0], [19, 0], [20, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART2_COV_2_bn", 
      "inputs": [[61, 0], [22, 0], [23, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART2_COV_2_pool", 
      "inputs": [[62, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART2_COV_2_relu", 
      "inputs": [[63, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART2_COV_3_conv", 
      "inputs": [[64, 0], [27, 0], [28, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART2_COV_3_bn", 
      "inputs": [[65, 0], [30, 0], [31, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART2_COV_3_pool", 
      "inputs": [[66, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART2_COV_3_relu", 
      "inputs": [[67, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART2_COV_4_conv", 
      "inputs": [[68, 0], [35, 0], [36, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART2_COV_4_bn", 
      "inputs": [[69, 0], [38, 0], [39, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART2_COV_4_pool", 
      "inputs": [[70, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART2_COV_4_relu", 
      "inputs": [[71, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Convolution", 
      "param": {
        "dilate": "(1,1)", 
        "kernel": "(3,3)", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(1,1)", 
        "stride": "(1,1)", 
        "workspace": "512"
      }, 
      "name": "PART2_COV_5_conv", 
      "inputs": [[72, 0], [43, 0], [44, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "BatchNorm", 
      "param": {
        "eps": "0.001", 
        "fix_gamma": "False", 
        "momentum": "0.9", 
        "use_global_stats": "False"
      }, 
      "name": "PART2_COV_5_bn", 
      "inputs": [[73, 0], [46, 0], [47, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Pooling", 
      "param": {
        "kernel": "(3,3)", 
        "pad": "(0,0)", 
        "pool_type": "max", 
        "stride": "(2,2)"
      }, 
      "name": "PART2_COV_5_pool", 
      "inputs": [[74, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Activation", 
      "param": {"act_type": "relu"}, 
      "name": "PART2_COV_5_relu", 
      "inputs": [[75, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "Flatten", 
      "param": {}, 
      "name": "flatten2", 
      "inputs": [[76, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Minus", 
      "param": {}, 
      "name": "_minus0", 
      "inputs": [[51, 0], [77, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "abs", 
      "param": {}, 
      "name": "abs0", 
      "inputs": [[78, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc_sub_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc_sub_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "name": "fc_sub", 
      "inputs": [[79, 0], [80, 0], [81, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul0", 
      "inputs": [[51, 0], [77, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc_mul_weight", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "null", 
      "param": {}, 
      "name": "fc_mul_bias", 
      "inputs": [], 
      "backward_source_id": -1
    }, 
    {
      "op": "FullyConnected", 
      "param": {
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "name": "fc_mul", 
      "inputs": [[83, 0], [84, 0], [85, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Plus", 
      "param": {}, 
      "name": "_plus0", 
      "inputs": [[82, 0], [86, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_Mul", 
      "param": {}, 
      "name": "_mul1", 
      "inputs": [[1, 0], [87, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "exp", 
      "param": {}, 
      "name": "exp0", 
      "inputs": [[88, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "_PlusScalar", 
      "param": {"scalar": "1"}, 
      "name": "_plusscalar0", 
      "inputs": [[89, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "log", 
      "param": {}, 
      "name": "log0", 
      "inputs": [[90, 0]], 
      "backward_source_id": -1
    }, 
    {
      "op": "MakeLoss", 
      "param": {"grad_scale": "1"}, 
      "name": "reid_loss", 
      "inputs": [[91, 0]], 
      "backward_source_id": -1
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    4, 
    6, 
    7, 
    11, 
    12, 
    14, 
    15, 
    19, 
    20, 
    22, 
    23, 
    27, 
    28, 
    30, 
    31, 
    35, 
    36, 
    38, 
    39, 
    43, 
    44, 
    46, 
    47, 
    52, 
    80, 
    81, 
    84, 
    85
  ], 
  "heads": [[92, 0]]
}