{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv1a_3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv1a_3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_stem_conv1a_3_3_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv1a_3_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv1a_3_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv1a_3_3_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv1a_3_3_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_stem_conv1a_3_3_bn", 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0], [6, 0, 1], [7, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_stem_conv1a_3_3_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2a_3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2a_3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_stem_conv2a_3_3_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2a_3_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2a_3_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2a_3_3_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2a_3_3_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_stem_conv2a_3_3_bn", 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0], [15, 0, 1], [16, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_stem_conv2a_3_3_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2b_3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2b_3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_stem_conv2b_3_3_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2b_3_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2b_3_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2b_3_3_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv2b_3_3_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_stem_conv2b_3_3_bn", 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 1], [25, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_stem_conv2b_3_3_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "part1_stem_maxpool3a_3_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv3b_1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv3b_1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_stem_conv3b_1_1_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "80", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv3b_1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv3b_1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv3b_1_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv3b_1_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_stem_conv3b_1_1_bn", 
      "inputs": [[31, 0, 0], [32, 0, 0], [33, 0, 0], [34, 0, 1], [35, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_stem_conv3b_1_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv4a_3_3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv4a_3_3_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_stem_conv4a_3_3_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv4a_3_3_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv4a_3_3_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv4a_3_3_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_stem_conv4a_3_3_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_stem_conv4a_3_3_bn", 
      "inputs": [[40, 0, 0], [41, 0, 0], [42, 0, 0], [43, 0, 1], [44, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_stem_conv4a_3_3_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "part1_reductionA_maxpool5a_3_3", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "96", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv_bn", 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv1_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "48", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv1_0_bn", 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0], [62, 0, 1], [63, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv1_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv1_1_conv", 
      "attr": {
        "kernel": "(5, 5)", 
        "num_filter": "64", 
        "pad": "(2, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv1_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv1_1_bn", 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 1], [72, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv1_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv2_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv2_0_bn", 
      "inputs": [[77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 1], [81, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv2_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv2_1_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv2_1_bn", 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0], [89, 0, 1], [90, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv2_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv2_2_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "96", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_2_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv2_2_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv2_2_bn", 
      "inputs": [[95, 0, 0], [96, 0, 0], [97, 0, 0], [98, 0, 1], [99, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv2_2_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "part1_reductionA_tower_pool3_0", 
      "attr": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv3_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv3_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionA_tower_conv3_1_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv3_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv3_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv3_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionA_tower_conv3_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionA_tower_conv3_1_bn", 
      "inputs": [[105, 0, 0], [106, 0, 0], [107, 0, 0], [108, 0, 1], [109, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionA_tower_conv3_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attr": {"num_args": "4"}, 
      "inputs": [[56, 0, 0], [74, 0, 0], [101, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_conv_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_conv_bn", 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_tower_conv_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_conv1_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_conv1_0_bn", 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_tower_conv1_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_conv1_1_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv1_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_conv1_1_bn", 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 1], [137, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_tower_conv1_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_conv2_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_conv2_0_bn", 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 1], [146, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_tower_conv2_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_conv2_1_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "48", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_conv2_1_bn", 
      "inputs": [[151, 0, 0], [152, 0, 0], [153, 0, 0], [154, 0, 1], [155, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_tower_conv2_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_conv2_2_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [158, 0, 0], [159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_2_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_conv2_2_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_conv2_2_bn", 
      "inputs": [[160, 0, 0], [161, 0, 0], [162, 0, 0], [163, 0, 1], [164, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_tower_conv2_2_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attr": {"num_args": "3"}, 
      "inputs": [[121, 0, 0], [139, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_out_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_out_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block35_0_tower_out_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "320", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_out_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_out_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_out_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block35_0_tower_out_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block35_0_tower_out_bn", 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0], [173, 0, 1], [174, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar0", 
      "attr": {"scalar": "0.17"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[112, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block35_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionB_tower_conv_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionB_tower_conv_bn", 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0], [184, 0, 1], [185, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionB_tower_conv_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionB_tower_conv1_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[178, 0, 0], [188, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionB_tower_conv1_0_bn", 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 1], [194, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionB_tower_conv1_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionB_tower_conv1_1_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[196, 0, 0], [197, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionB_tower_conv1_1_bn", 
      "inputs": [[199, 0, 0], [200, 0, 0], [201, 0, 0], [202, 0, 1], [203, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionB_tower_conv1_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionB_tower_conv1_2_conv", 
      "attr": {
        "kernel": "(3, 3)", 
        "num_filter": "384", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[205, 0, 0], [206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_2_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionB_tower_conv1_2_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionB_tower_conv1_2_bn", 
      "inputs": [[208, 0, 0], [209, 0, 0], [210, 0, 0], [211, 0, 1], [212, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionB_tower_conv1_2_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "part1_reductionB_tower_pool", 
      "attr": {
        "kernel": "(3, 3)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[178, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attr": {"num_args": "3"}, 
      "inputs": [[187, 0, 0], [214, 0, 0], [215, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_0_tower_conv_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[216, 0, 0], [217, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_0_tower_conv_bn", 
      "inputs": [[219, 0, 0], [220, 0, 0], [221, 0, 0], [222, 0, 1], [223, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_0_tower_conv_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_0_tower_conv1_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "129", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[216, 0, 0], [226, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_0_tower_conv1_0_bn", 
      "inputs": [[228, 0, 0], [229, 0, 0], [230, 0, 0], [231, 0, 1], [232, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_0_tower_conv1_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[233, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_0_tower_conv1_1_conv", 
      "attr": {
        "kernel": "(1, 7)", 
        "num_filter": "160", 
        "pad": "(1, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[234, 0, 0], [235, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_0_tower_conv1_1_bn", 
      "inputs": [[237, 0, 0], [238, 0, 0], [239, 0, 0], [240, 0, 1], [241, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_0_tower_conv1_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_0_tower_conv1_2_conv", 
      "attr": {
        "kernel": "(7, 1)", 
        "num_filter": "192", 
        "pad": "(2, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[243, 0, 0], [244, 0, 0], [245, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_2_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_conv1_2_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_0_tower_conv1_2_bn", 
      "inputs": [[246, 0, 0], [247, 0, 0], [248, 0, 0], [249, 0, 1], [250, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_0_tower_conv1_2_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attr": {"num_args": "2"}, 
      "inputs": [[225, 0, 0], [252, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_out_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_out_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_0_tower_out_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "1088", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[253, 0, 0], [254, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_out_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_out_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_out_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_0_tower_out_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_0_tower_out_bn", 
      "inputs": [[256, 0, 0], [257, 0, 0], [258, 0, 0], [259, 0, 1], [260, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar1", 
      "attr": {"scalar": "0.1"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[216, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[263, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_1_tower_conv_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "192", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[264, 0, 0], [265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_1_tower_conv_bn", 
      "inputs": [[267, 0, 0], [268, 0, 0], [269, 0, 0], [270, 0, 1], [271, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_1_tower_conv_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_0_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_1_tower_conv1_0_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "129", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[264, 0, 0], [274, 0, 0], [275, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_0_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_0_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_0_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_0_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_1_tower_conv1_0_bn", 
      "inputs": [[276, 0, 0], [277, 0, 0], [278, 0, 0], [279, 0, 1], [280, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_1_tower_conv1_0_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[281, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_1_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_1_tower_conv1_1_conv", 
      "attr": {
        "kernel": "(1, 7)", 
        "num_filter": "160", 
        "pad": "(1, 2)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[282, 0, 0], [283, 0, 0], [284, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_1_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_1_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_1_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_1_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_1_tower_conv1_1_bn", 
      "inputs": [[285, 0, 0], [286, 0, 0], [287, 0, 0], [288, 0, 1], [289, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_1_tower_conv1_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[290, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_2_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_1_tower_conv1_2_conv", 
      "attr": {
        "kernel": "(7, 1)", 
        "num_filter": "192", 
        "pad": "(2, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[291, 0, 0], [292, 0, 0], [293, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_2_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_2_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_2_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_conv1_2_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_1_tower_conv1_2_bn", 
      "inputs": [[294, 0, 0], [295, 0, 0], [296, 0, 0], [297, 0, 1], [298, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_1_tower_conv1_2_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[299, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attr": {"num_args": "2"}, 
      "inputs": [[273, 0, 0], [300, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_out_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_out_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_repeat_block17_1_tower_out_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "1088", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[301, 0, 0], [302, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_out_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_out_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_out_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_repeat_block17_1_tower_out_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_repeat_block17_1_tower_out_bn", 
      "inputs": [[304, 0, 0], [305, 0, 0], [306, 0, 0], [307, 0, 1], [308, 0, 1]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "_mulscalar2", 
      "attr": {"scalar": "0.1"}, 
      "inputs": [[309, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[264, 0, 0], [310, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_repeat_block17_1_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[311, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv_bias", 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part1_reductionC_tower_conv_conv", 
      "attr": {
        "kernel": "(1, 1)", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[312, 0, 0], [313, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv_gamma", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv_beta", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv_bn_moving_mean", 
      "attr": {"__init__": "[\"zero\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv_bn_moving_var", 
      "attr": {"__init__": "[\"one\", {}]"}, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part1_reductionC_tower_conv_bn", 
      "inputs": [[315, 0, 0], [316, 0, 0], [317, 0, 0], [318, 0, 1], [319, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part1_reductionC_tower_conv_act", 
      "attr": {"act_type": "relu"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv0_1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part1_reductionC_tower_conv0_1_bias", 
